#include <stdio.h>
#include <stdlib.h>
#include <wchar.h>

#include "../../include/progress.h"

#define STRUCT_SIZE sizeof(PokeGlobalData)


void writePokemonData(PokeGlobalData *pokemon, int structCount) {
    const char *filename = "./pokedata.bin";
    FILE *file = fopen(filename, "wb");
    if (file == NULL) {
        perror("Failed to open file");
        return;
    }

    // 구조체의 총 개수를 파일에 씀
    fwrite(&structCount, sizeof(int), 1, file);

    // 각 구조체 데이터를 파일에 씀
    fwrite(pokemon, STRUCT_SIZE, structCount, file);

    fclose(file);
}

int main() {
    // 저장할 포켓몬 데이터
    // 풀: 1, 물 11, 불 21, 돌 31, 전기 41, 노말 51
    PokeGlobalData pokemon[] = {
    // 처음 0~5 랜덤 하나랑 승부 
    {L"이상해꽃", L"grass", 0, 5, 140, 9, {1, 51, 11, 3, 53, 5, 15, 7, 9}},
    {L"꼬부기", L"water", 1, 5, 140, 8, {52, 13, 56, 14, 16, 58, 18, 20}},
    {L"피카츄", L"electric", 2, 5, 140, 9, {41, 52, 43, 45, 56, 47, 48, 49, 60}},

    {L"우파", L"water", 3, 5, 140, 8, {11, 54, 13, 55, 15, 57, 17, 19}},
    {L"모래두지", L"rock", 4, 5, 130, 8, {31, 53, 32, 33, 57, 35, 37, 39}},
    {L"치코리타", L"grass", 5, 5, 160, 9, {1, 11, 2, 4, 15, 6, 8, 19, 10}},
    // 두번째 6~11 랜덤 두개랑 승부
    {L"잠만보", L"normal", 6, 10, 200, 8, {54, 56, 36, 57, 39, 40, 58, 60}},
    {L"따라큐", L"normal", 7, 10, 210, 8, {52, 43, 54, 56, 47, 58, 49, 60}},
    {L"켈리몬", L"water", 8, 10, 230, 8, {12, 14, 6, 7, 16, 18, 10, 20}},
    {L"리오르", L"rock", 9, 10, 190, 8, {54, 36, 37, 30, 57, 58, 38, 40}},
    {L"이브이", L"normal", 10, 10, 190, 9, {51, 33, 52, 35, 53, 55, 38, 57, 59}},
    {L"닥트리오", L"rock", 11, 10, 200, 8, {31, 32, 33, 34, 35, 36, 37, 38}},
    // 세번째 12~16 랜덤 세개랑 승부
    {L"가디안", L"grass", 12, 15, 240, 8, {3, 4, 5, 6, 7, 8, 9, 10}},
    {L"피츄", L"electric", 13, 15, 230, 9, {53, 41, 42, 43, 56, 44, 45, 58, 46}},
    {L"리자몽", L"fire", 14, 15, 250, 9, {55, 24, 25, 26, 59, 27, 28, 29, 30}},
    {L"포니타", L"fire", 15, 15, 220, 9, {22, 52, 23, 24, 25, 54, 26, 27, 28}},
    {L"블랙키", L"normal", 16, 15, 220, 8, {51, 52, 53, 56, 57, 58, 59, 60}},
    // 네번째 17~21 랜덤 세개랑 승부
    {L"거북왕", L"water", 17, 15, 270, 8, {15,16, 57, 17,18, 60, 19,20}},
    {L"주피썬더", L"electric", 18, 15, 260, 8, {41, 54, 43, 45, 46, 47, 60, 49}},
    {L"탕구리", L"rock", 19, 15, 250, 8, {31, 32, 55, 33, 38, 58, 39, 40}},
    {L"리자드", L"fire", 20, 15, 250, 8, {21, 22, 55, 23, 28, 57, 29, 30}},
    {L"폴리곤", L"electric", 21, 15, 260, 9, {41, 42, 35, 43, 47, 39, 48, 49, 50}},
    // 마지막 
    {L"레지스틸", L"rock", 22, 20, 430, 9, {38,48,58,39,49,59,30,40,50}},
    {L"레큐자", L"normal", 23, 20, 450, 10, {8,18,28,38,48,9,19,29,49,59}},
    // 그냥 이벤트 
    {L"아르세우스", L"normal", 24, 99, 9999, 10, {19,29,39,49,59,10,20,30,40,60}},

    {L"레큐자(BIG)", L"normal", 25, 99, 9999, 10, {8,18,28,38,48,9,19,29,49,59}},

        // 나머지 구조체 데이터 추가
    };

    // 저장할 구조체의 총 개수
    int structCount = sizeof(pokemon) / sizeof(PokeGlobalData);

    // 파일에 구조체 데이터 저장
    writePokemonData(pokemon, structCount);

    printf("포켓몬 구조체 데이터를 파일에 저장했습니다.\n");

    return 0;
}
